mlsorensen/Apollo2/src/device/main.cpp
  delay(300);  // let USB-CDC enumerate
  core::logf("\n");
  core::logf("Micra remote — %s\n", board::kName);
  {
    // Why did we boot? Distinguishes power-rail dips (BROWNOUT/POWERON — e.g.
    // the USB<->battery switchover glitch on the P4 4.3) from firmware faults.
    const esp_reset_reason_t rr = esp_reset_reason();
    const char* name = "other";
    switch (rr) {
      case ESP_RST_POWERON:   name = "power-on"; break;
      case ESP_RST_SW:        name = "software"; break;
      case ESP_RST_PANIC:     name = "panic"; break;
      case ESP_RST_INT_WDT:
      case ESP_RST_TASK_WDT:
      case ESP_RST_WDT:       name = "watchdog"; break;
      case ESP_RST_BROWNOUT:  name = "brownout"; break;
      case ESP_RST_DEEPSLEEP: name = "deep-sleep wake"; break;
      case ESP_RST_USB:       name = "usb"; break;
      default: break;
    }
    core::logf("reset reason: %s (%d)\n", name, static_cast<int>(rr));
  }
  {
    // Which OTA slot is live, and is it awaiting its health confirm?
    const esp_partition_t* run = esp_ota_get_running_partition();
    esp_ota_img_states_t st;
    const bool pending = esp_ota_get_state_partition(run, &st) == ESP_OK &&
                         st == ESP_OTA_IMG_PENDING_VERIFY;
    core::logf("OTA: running from %s%s\n", run != nullptr ? run->label : "?",
               pending ? " (pending verify - confirms after 60s)" : "");
  }
#if defined(CONFIG_ESP_COREDUMP_ENABLE_TO_FLASH)
  {
    // A panic/watchdog reset leaves an ELF coredump in the `coredump` flash
    // partition. Announce it so /log readers know a downloadable post-mortem
    // exists; it persists (across reboots AND reflashes) until erased or
    // overwritten by the next crash.
    size_t cd_addr = 0, cd_size = 0;
    if (esp_core_dump_image_get(&cd_addr, &cd_size) == ESP_OK && cd_size > 0)
      core::logf("crash dump stored (%u bytes) — download at /coredump, "
                 "clear with /coredump?erase=1\n",
                 static_cast<unsigned>(cd_size));
  }
#endif
  g_config.begin();  // create NVS namespace on first boot (quiets read errors)

#if defined(BOARD_DISPLAY_DSI) || defined(BOARD_DISPLAY_RGB)
  // Boot-flag OTA install: an "Install now" tap set a target version and
  // rebooted here. Do the install NOW — before the full app/BLE come up. On the
  // hosted-radio DSI boards this also matters for the DMA pool (a light display
  // is used so the download's SDIO RX can get its contiguous buffer); on native-
  // WiFi RGB boards it's just a clean, self-contained flow. run() shows a
  // progress UI, downloads to PSRAM, writes flash with the screen blanked
  // (flash writes glitch the panel), and reboots. Never returns when set.
  if (!g_config.pending_install().empty()) {
    platform::install_mode::run(g_config);
  }
#endif

#if defined(CONFIG_ESP_HOSTED_ENABLE_BT_NIMBLE)
  // Hosted-radio boards (P4 + C6 over SDIO): the transport must be brought up
  // through Arduino's hosted HAL (esp_hosted_init + connect_to_slave + BT
  // controller RPC) before any NimBLE call. esp-nimble-cpp's init alone lands
  // in the vhci driver with the SDIO link down -> "card init failed" + abort.
  core::logf("hosted radio: bringing up SDIO link to co-processor...\n");
  if (!hostedInitBLE()) {
    core::logf("ERROR: hosted radio init failed; BLE unavailable\n");
  } else {
    core::logf("hosted radio: link up\n");
  }
#endif

  if (!g_display.begin()) {
    core::logf("ERROR: display init failed\n");
    return;
  }
  core::logf("Display up: %d x %d\n", g_display.width(), g_display.height());

  if (g_touch.begin(g_display.width(), g_display.height())) {
    core::logf("Touch up: CST816\n");
  } else {
    core::logf("WARN: CST816 touch not detected on I2C\n");
  }

#if defined(CONFIG_ESP_HOSTED_ENABLE_BT_NIMBLE)
  // One-time co-processor (C6) firmware update: the factory slave is stale
  // (mismatched host lib -> boot RPC timeout + broken RX under load). We flash
  // the embedded matching image now — display is up so we can show progress,
  // and this is the quiet window (WiFi/NimBLE not started yet). Host->slave TX
  // over SDIO, so it works on the stale slave. On success the C6 reboots and we
  // reboot the P4 to re-init the link. See c6_update.cpp.
  if (platform::c6_update_needed()) {
    core::logf("C6 update: needed; applying embedded slave firmware\n");
    lv_obj_t* ov = lv_obj_create(lv_screen_active());
    lv_obj_remove_style_all(ov);
    lv_obj_set_size(ov, lv_pct(100), lv_pct(100));
    lv_obj_set_style_bg_color(ov, lv_color_hex(0x101418), 0);
    lv_obj_set_style_bg_opa(ov, LV_OPA_COVER, 0);
    lv_obj_set_flex_flow(ov, LV_FLEX_FLOW_COLUMN);
    lv_obj_set_flex_align(ov, LV_FLEX_ALIGN_CENTER, LV_FLEX_ALIGN_CENTER,
                          LV_FLEX_ALIGN_CENTER);
    lv_obj_set_style_pad_row(ov, 18, 0);
    lv_obj_t* title = lv_label_create(ov);
    lv_label_set_text(title, "Updating Wi-Fi co-processor");
    lv_obj_set_style_text_color(title, lv_color_hex(0xFFFFFF), 0);
    lv_obj_t* sub = lv_label_create(ov);
    lv_label_set_text(sub, "One-time setup, ~30s - please wait, don't power off.");
    lv_obj_set_style_text_color(sub, lv_color_hex(0xA0A0A0), 0);
    lv_obj_t* bar = lv_bar_create(ov);
    lv_obj_set_size(bar, lv_pct(70), 18);
    lv_bar_set_range(bar, 0, 100);
    lv_obj_t* pctlbl = lv_label_create(ov);
    lv_label_set_text(pctlbl, "0%");
    lv_obj_set_style_text_color(pctlbl, lv_color_hex(0xFFFFFF), 0);
    lv_timer_handler();
    const bool ok = platform::c6_update_apply([&](int pct) {
      lv_bar_set_value(bar, pct, LV_ANIM_OFF);
      char b[8];
      std::snprintf(b, sizeof(b), "%d%%", pct);
      lv_label_set_text(pctlbl, b);
      lv_timer_handler();  // pump the panel between chunks
    });
    core::logf("C6 update: %s\n", ok ? "applied; rebooting" : "failed");
    lv_label_set_text(sub, ok ? "Done - restarting..."
                              : "Update failed - continuing on old firmware.");
    lv_timer_handler();
    Serial.flush();
    delay(1500);
    if (ok) esp_restart();  // reboot P4 so the hosted link re-inits on new slave
    lv_obj_delete(ov);      // failure: drop the overlay and boot normally
  }
#endif

  g_battery.begin();
  g_clock.begin();  // seed wall-clock from the RTC (if any); I2C is up via Display
  core::log_ring().set_clock(&g_clock);  // wall-clock stamps from here on

  // Paddle hardware (after the display so the IO extension is begun where the
  // paddle rides it; pins honor the per-unit NVS "padsense"/"paddrive" repair
  // overrides — see poll_serial_id). Seed the shot config from NVS and wire
  // the persisters.
  platform::paddle().begin(g_config.paddle_sense_pin(), g_config.paddle_drive_pin());
  g_brew.seed(g_config.target_weight_g(), g_config.shot_mode(), g_config.overshoot_g(),
              g_config.review_hold_s(), g_config.wired_paddle(), g_config.flush_s(),
              g_config.flush_delay_s(), g_config.hint_overshoot_g(),
              g_config.detect_lead_in_s());
  // A paddle flip while the connected Micra sits in standby only WAKES it (no
  // water moves) — tell the controller so it passes the flip through without
  // starting a phantom shot. Only a KNOWN not-on state counts; disconnected or
  // unknown falls back to normal shot handling.
  g_brew.set_standby_provider([] {
    const core::MachineSnapshot s = g_micra.snapshot();
    const bool wake_only = s.link == core::Link::Connected && s.power != core::Power::On;
    // This is a PREDICATE, not an edge hook: BrewController::snapshot() asks it
    // (via can_clean) on every call, and pump_scale_chart takes a snapshot every
    // loop iteration — so logging unconditionally printed at frame rate for as
    // long as the machine sat connected in standby. On a UART that write BLOCKS,
    // which is milliseconds stolen from every frame (see the DSI sync's own note
    // in display.cpp) and enough to visibly stall rendering.
    //
    // Log the TRANSITIONS instead: a "shot instead of wake" report still hinges
    // on what link/power read here, and that answer only changes when they do.
    static int last_link = -1, last_power = -1;
    if (static_cast<int>(s.link) != last_link || static_cast<int>(s.power) != last_power) {
      last_link = static_cast<int>(s.link);
      last_power = static_cast<int>(s.power);
      core::logf("Paddle standby check: link=%d power=%s -> %s\n", last_link,
                 s.power == core::Power::On        ? "On"
                 : s.power == core::Power::Standby ? "Standby"
                                                   : "Off",
                 wake_only ? "wake only" : "shot path");
    }
    return wake_only;
  });
  g_brew.set_target_persister([](float g) { g_config.set_target_weight_g(g); });
  g_brew.set_shot_mode_persister([](int mode) { g_config.set_shot_mode(mode); });
  g_brew.set_overshoot_persister([](float g) { g_config.set_overshoot_g(g); });
  g_brew.set_hint_overshoot_persister([](float g) { g_config.set_hint_overshoot_g(g); });
  g_brew.set_review_hold_persister([](int s) { g_config.set_review_hold_s(s); });
  g_brew.set_detect_lead_in_persister([](int s) { g_config.set_detect_lead_in_s(s); });
  g_brew.set_wired_paddle_persister([](bool on) { g_config.set_wired_paddle(on); });
  g_brew.set_flush_persister([](int s) { g_config.set_flush_s(s); });
  g_brew.set_flush_delay_persister([](int s) { g_config.set_flush_delay_s(s); });
  core::logf("Paddle: %s\n",
             platform::paddle().available() ? "available" : "not wired on this board");
  // Restore saved brightness where dimmable; otherwise hold the backlight at max
  // (an on/off-only board has no brightness control in the UI).
  g_display.set_brightness(board::kSupportsBrightness ? g_config.brightness() : 100);

  // Speaker (audio boards): codec + I2S set up front so button clicks are
  // instant. Needs Wire + the IO extension, which the display init above
  // brought up. Gated on the sound settings so turning them ALL off + Restart
  // leaves the whole audio stack cold — the escape hatch if audio ever
  // interferes with BLE again (the always-clocking first cut broke connects).
  // Report what the audio stack costs in INTERNAL ram. The P4 5" runs close to
  // the ceiling (720x1280 framebuffers + hosted WiFi/BLE + the DSI sync's DMA
  // descriptor lists), and there a few KB decides whether esp_lcd can allocate
  // a GDMA link list at all. A silent starvation bug is the expensive kind.
  {
    const unsigned before = static_cast<unsigned>(
        heap_caps_get_free_size(MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT));
    if (g_config.click_sound() || (g_config.ready_chime_volume() > 0 &&
                                   g_config.ready_chime_melody() > 0))
      platform::sound_begin();
    const unsigned after = static_cast<unsigned>(
        heap_caps_get_free_size(MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT));
    core::logf("heap: internal free=%u after sound (cost %d, largest=%u)\n", after,
               static_cast<int>(before) - static_cast<int>(after),
               static_cast<unsigned>(heap_caps_get_largest_free_block(
                   MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT)));
  }

  // Build the UI bound to the machine + provisioner + battery + display.
  const ui::ScreenProfile screen{g_display.width(), g_display.height(),
                                 board::kUiScale};
#if defined(BOARD_HAS_SD_MMC)
  g_shots.begin();  // writer task; mounts lazily, so no card is fine
#endif
  // One web server for everything: the setup portal's pages ride it during
  // AP sessions; on the home network it serves the shot-history app + API.
  // The theme callback reads the ACTIVE palette per request, so the web page
  // always matches whatever the screen is showing.
  g_web_ui.begin(g_token_setup, g_shots, g_clock, "Apollo 2", [] {
    return platform::WebTheme{
        ui::theme::bg(),   ui::theme::rail(),  ui::theme::card(),
        ui::theme::text(), ui::theme::muted(), ui::theme::accent(),
        ui::theme::ok(),   ui::theme::warn(),  ui::theme::alert()};
  });
  g_app.build(g_micra, g_provisioner, g_battery, g_display_settings, g_clock, g_history,
              g_scale, g_scale_provisioner, g_brew, g_network, platform::sound(), g_shots,
              screen, &g_update_check);

  // Settings "Restart display": on RGB boards this is a panel DMA resync, not
  // a reboot — the shifted/ghosted raster is a latched bounce-buffer underrun,
  // and esp_lcd_rgb_panel_restart() realigns it at the next VSYNC in place.
  // Non-RGB boards (and a missing panel handle) fall back to the old full
  // soft reboot.
  g_app.set_restart_handler([] {
    if (g_display.rgb_resync()) return;
    core::logf("User-requested restart\n");
    Serial.flush();
    esp_restart();
  });

