mlsorensen/Apollo2/src/device/main.cpp
  // Critically-low battery -> deep sleep instead of brown-out thrashing. Kill the
  // backlight first (dominant load, can latch on in sleep), then park (~uA) until a
  // touch. The dark check above gates the next boot on actually being charged.
  g_app.set_low_battery_handler(board::kBatteryCutoffVolts, [] {
    core::logf("Battery critical -> deep sleep; charge, then touch to wake\n");
    Serial.flush();
    g_display.set_brightness(0);
    enter_lowbatt_sleep();
  });

  // "Install now" (update notice): stash the target version and reboot into the
  // early-boot install mode (see the top of setup()), which downloads + flashes
  // with a clean DMA pool. Installing never happens live in the app.
  g_app.set_install_handler([](const std::string& version) {
    g_config.set_pending_install(version);
    core::logf("UpdateInstall: reboot into install mode for %s\n", version.c_str());
    Serial.flush();
    delay(1500);  // let the "Installing update" notice show before we reboot
    esp_restart();
  });

  // Bring up NimBLE once here (single-threaded), so the Micra + scale link tasks
  // — which each guard on isInitialized() — share one host without racing init.
  // ORDER MATTERS on native-radio (S3) boards: NimBLE's BT-controller init runs
  // interrupt allocation (btdm_intr_alloc) on the ~1 KB ipc0 task, which has
  // almost no headroom. If WiFi is mid-connect at the same instant, its radio
  // ISRs nest on top and overflow ipc0's stack -> intermittent boot crash
  // (canary watchpoint, ipc0). So init BT on a quiet ipc0 BEFORE starting WiFi.
  // See the [[s3-ipc0-nimble-wifi-crash]] notes. (P4 offloads the radio to the
  // C6 via hostedInitBLE() earlier, so this only bites the S3, but the ordering
  // is harmless everywhere.)
  NimBLEDevice::init("micra-remote");

  // Join home WiFi (if enabled) for NTP time. Update checks run LIVE from loop()
  // with BLE up: mbedTLS is pointed at PSRAM (see update_check.cpp) so a small
  // TLS fetch no longer starves the hosted radio's internal-DMA pool.
  g_network.begin();

  // Radio arbitration: the host refuses to scan while ANY connect is pending,
  // so each link's scan preempts the OTHER link's connect attempts (cancels an
  // in-flight one, holds new ones off until the scan finishes). Without this,
  // a Settings scan silently returned nothing whenever the other device sat in
  // "Connecting" (user-reported on the 4.3C).
  g_micra.set_scan_peer_pauser([](bool on) { g_scale.pause_connects(on); });
  g_scale.set_scan_peer_pauser([](bool on) { g_micra.pause_connects(on); });

  // Seed the link from saved config, then start the background BLE task. With
  // no MAC -> Unconfigured; MAC but no token -> NeedsToken (Settings "Setup").
  const std::string mac = g_config.mac();
  g_micra.set_name(g_config.name());
  g_micra.set_token(g_config.token());
  core::logf("Saved machine: mac=%s token=%s\n", mac.empty() ? "(none)" : mac.c_str(),
             g_config.token().empty() ? "(none)" : "set");
  // Opt-in auto-connect (Micra > Settings): grab the saved machine at boot
  // instead of waiting for a Connect tap. Default off — a connected remote
  // occupies the Micra's single BLE slot.
  if (!mac.empty() && g_config.auto_connect()) g_micra.set_connect_enabled(true);
  g_micra.begin(mac);

  // Start the Bluetooth scale link from its saved MAC (empty -> idles).
  const std::string scale_mac = g_config.scale_mac();
  g_scale.set_name(g_config.scale_name());
  core::logf("Saved scale: mac=%s\n", scale_mac.empty() ? "(none)" : scale_mac.c_str());
  g_scale.begin(scale_mac);
}

namespace {

// Serial identity query: the web flasher (site/) writes "id?" down the serial
// port to learn which board it's talking to before offering a firmware image
// (the boards are indistinguishable over USB otherwise). Keep the reply a
// single stable line — the page substring-matches the board name out of it,
// exactly like tools/flash.sh does with the boot banner.
void poll_serial_id() {
  static char buf[16];
  static size_t n = 0;
  while (Serial.available() > 0) {
    const char c = static_cast<char>(Serial.read());
    if (c == '\n' || c == '\r') {
      buf[n] = '\0';
      if (n == 3 && std::strcmp(buf, "id?") == 0) {
        // REV: the silicon revision (efuse major*100+minor, e.g. 103 = v1.3).
        // Future-proofing for P4 boards shipping in both revision generations:
        // when per-silicon images exist, the web flasher's Detect can pick the
        // right one from this. Appended field — existing parsers substring-match.
        core::logf("APOLLO2 BOARD=\"%s\" FW=%s REV=%u\n", board::kName, fw::kVersion,
                   static_cast<unsigned>(efuse_hal_chip_revision()));
      } else if (std::strncmp(buf, "padsense=", 9) == 0 ||
                 std::strncmp(buf, "paddrive=", 9) == 0) {
        // Per-UNIT paddle GPIO overrides (NVS; survive reflashes). Repair
        // knobs for a unit with a damaged pad: "padsense=50" / "paddrive=49"
        // move that wire's pin, "=-1" reverts to the board default. Applied
        // at next boot (paddle().begin() reads them once).
        const bool sense = buf[3] == 's';
        const int pin = std::atoi(buf + 9);
        if (sense) {
          g_config.set_paddle_sense_pin(pin);
        } else {
          g_config.set_paddle_drive_pin(pin);
        }
        const char* name = sense ? "padsense" : "paddrive";
        const int fallback = sense ? board::kPaddleSensePin : board::kPaddleDrivePin;
        if (pin >= 0) {
          core::logf("%s: override saved (GPIO%d) — applying now\n", name, pin);
        } else {
          core::logf("%s: override cleared (board default GPIO%d) — "
                     "applying now\n", name, fallback);
        }
        // Re-run begin() with the resolved pins so the change is live
        // immediately (also releases the drive line; harmless outside a shot).
        platform::paddle().begin(g_config.paddle_sense_pin(),
                                 g_config.paddle_drive_pin());
      }
      n = 0;
    } else if (n < sizeof(buf) - 1) {
      buf[n++] = c;
    } else {
      n = 0;  // overlong line: not our query
    }
  }
}

}  // namespace

void loop() {
  poll_serial_id();          // web-flasher "which board is this?" responder
  g_brew.poll(millis());     // paddle relay + shot state machine (edge-critical)
  g_app.pump_scale_chart();  // drain the scale's flow stream into the graph (fast)
  lv_timer_handler();        // LVGL render/input
  g_token_setup.handle();    // portal auto-close timeout
  g_web_ui.poll();           // S3 boards serve here; no-op on the P4s (task)

#if defined(BOARD_DISPLAY_RGB)
  // One-shot raster resync at 2 s for the boot ghost (~1/4 of cold boots come
  // up latched a few px off from underruns while setup floods the PSRAM bus).
  // The resync is VSYNC-aligned (armed here, executed inside vertical
  // blanking by the display's resync task) but still shows a one-frame ~5 px
  // jump — the bounce-buffer refill runs with the timing engine stopped —
  // which is why it's NOT on a periodic timer: the user found a 5 s cadence
  // distracting. Runtime ghosts are healed manually via Settings > "Restart
  // display" instead. (An earlier mid-frame, non-VSYNC-aligned version was
  // far worse: full blank AND could itself latch a fresh ghost — keep the
  // alignment if refactoring.)
  static bool boot_resync_done = false;
  if (!boot_resync_done && millis() >= 2000) {
    boot_resync_done = true;
    g_display.rgb_resync(/*verbose=*/false);
  }
#endif

  // Internal-heap telltale, once a minute: the S3 boards live close to the
  // internal-RAM ceiling (on-chip WiFi+BLE + task stacks + DMA buffers), and
  // every starvation bug so far surfaced as some SILENT downstream failure.
  // With this line in the log, the next one arrives with numbers attached.
  //
  // Sampled every 250ms and reported as a MINIMUM, because a once-a-minute
  // reading misses every transient: an update fetch lasts ~1s, a BLE scan a few
  // seconds, and those dips are exactly what starve the WiFi driver's RX pool.
  //
  // Both capability masks are reported. Plain INTERNAL also counts 32-bit-only
  // IRAM, which ordinary allocations (malloc, task stacks, lwIP pbufs, WiFi RX
  // buffers) can NEVER use — measured 2026-09-09 on the 4.3C, plain INTERNAL
  // read 13812 while 8BIT read 8180 at the same moment. 8BIT is the number that
  // decides whether an allocation actually succeeds; anything gating on plain
  // INTERNAL reads ~5.6KB high. The gap is logged so it stays visible.
  // COST NOTE: heap_caps_get_largest_free_block() WALKS THE HEAP holding the heap
  // lock, so it is not free to call often — it blocks other tasks' allocations
  // and janks the UI. Measured 2026-09-09 that plain INTERNAL and INTERNAL|8BIT
  // return identical values on this board, so only the 8BIT walk is kept, at
  // 500ms — still 2-4 samples across a ~1-2s fetch, at a quarter the cost of the
  // first cut (two walks every 250ms).
  static uint32_t last_heap_sample_ms = 0;
  static size_t min_largest_8bit = static_cast<size_t>(-1);
  if (millis() - last_heap_sample_ms >= 500u) {
    last_heap_sample_ms = millis();
    const size_t l8 = heap_caps_get_largest_free_block(MALLOC_CAP_INTERNAL |
                                                       MALLOC_CAP_8BIT);
    if (l8 < min_largest_8bit) min_largest_8bit = l8;
  }
  static uint32_t last_heap_log_ms = 0;
  if (millis() - last_heap_log_ms >= 60u * 1000u) {
    last_heap_log_ms = millis();
    // loop_hw = bytes of THIS task's stack never touched. ARDUINO_LOOP_STACK_SIZE
    // is 16KB by guess (a past overflow on theme rebuild + WiFi bring-up); this
    // is the number to size it from.
    core::logf(
        "heap: internal free=%u largest=%u min=%u | loop_hw=%u\n",
        static_cast<unsigned>(
            heap_caps_get_free_size(MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT)),
        static_cast<unsigned>(heap_caps_get_largest_free_block(
            MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT)),
        static_cast<unsigned>(min_largest_8bit),
        static_cast<unsigned>(uxTaskGetStackHighWaterMark(nullptr)));
    min_largest_8bit = static_cast<size_t>(-1);
  }

  // Hourly last-known-time snapshot -> NVS, so the next boot without a
  // surviving RTC starts approximately right instead of at 1970.
  static uint32_t last_time_save_ms = 0;
  if (millis() - last_time_save_ms >= 3600u * 1000u) {
    last_time_save_ms = millis();
    const std::time_t now_unix = g_clock.now_unix();
    if (now_unix != 0) g_config.set_last_unix(now_unix);
  }
  g_network.poll();          // drive the WiFi station state machine + NTP->RTC

  // Park BLE reconnect scanning while the machine is idle (screensaver on): it
  // stops the pointless "connect failed" churn when nobody's using the machine
  // AND frees the ~40 KB of internal RAM the radio's scanning holds — which is
  // what lets the daily update check (fired only while idle, above) run reliably
  // on the heap-tight S3. Only NEW (re)connect attempts are suppressed; an
  // already-established Micra/scale link stays connected. Resumes on wake.
  {
    static bool saver_prev = false;
    const bool saver = g_app.screensaver_active();
    if (saver != saver_prev) {
      saver_prev = saver;
      g_micra.pause_connects(saver);
      g_scale.pause_connects(saver);
    }
  }

  // Update check (notify-only): the App requests a check — automatically once
  // per boot when "check at startup" is on, or from the Info button — and the
  // App watches check_seq() for the result. We just spawn the live fetch task
  // when a request is pending and the network's genuinely up (station + NTP,
  // proof the internet's reachable); it no-ops without WiFi. TLS runs against
  // PSRAM so it coexists with the BLE links (see update_check.cpp). Never start
  // one mid-shot — the radio and heap are busy and a notice would interrupt.
  {
    // Automatic boot check: fire once the network's ready, and RETRY a few
    // times if it can't reach the server — DNS often isn't resolvable for a
    // second or two right after WiFi associates, and a single miss would
    // silently skip the boot notice for the whole session. Retries stop as soon
    // as one check reaches the server (last_check_ok), or after a few tries.
    static int boot_tries = 0;
    static bool boot_done = false;
    static uint32_t next_boot_try_ms = 0;
    // Bound the boot check to ~1 min of uptime so its retries never spill into
    // normal use (a slow NTP delays the start; cap it regardless — the daily
    // idle check and a manual check cover a machine whose NTP wasn't ready yet).
    if (!boot_done && millis() > 60000) boot_done = true;
    if (!boot_done && g_update_check.check_cadence() >= 1 &&
        g_update_check.network_ready() && !g_update_check.task_active() &&
        !core::shot_in_flight(g_brew.snapshot()) && millis() >= next_boot_try_ms) {
      if (boot_tries > 0 && g_update_check.last_check_ok()) {
        boot_done = true;  // a check reached the server; nothing more to do
      } else if (boot_tries >= 5) {
        boot_done = true;
        core::logf("UpdateCheck: boot check unreachable after retries\n");
      } else {
        core::logf("UpdateCheck: automatic check at boot (try %d)\n", ++boot_tries);
        g_update_check.begin_check();
        next_boot_try_ms = millis() + 6000;  // space retries while DNS settles
      }
    }
    // Daily cadence (mode 2): re-check every ~24 h, but ONLY while idle (the
    // screensaver is on). BLE reconnect scanning is parked during the saver (see
    // below), so the check runs with internal RAM freed — reliable, and never
    // during active use. If the saver is disabled the daily check won't fire;
    // boot + manual still cover it.
    static uint32_t last_daily_ms = 0;
    if (g_update_check.check_cadence() == 2 && boot_done &&
        g_app.screensaver_active() &&
        g_update_check.network_ready() && !g_update_check.task_active() &&
        !core::shot_in_flight(g_brew.snapshot()) &&
        millis() - last_daily_ms >= 24u * 60u * 60u * 1000u) {
      last_daily_ms = millis();
      core::logf("UpdateCheck: daily automatic check\n");
      g_update_check.begin_check();
    }
    // Consume the request LAST: if the network isn't ready yet (NTP still
    // syncing) or a shot's running, leave it pending so the check fires as soon
    // as it can — a manual check's "Checking..." spinner then resolves on its
    // own instead of hanging on a swallowed request.
    const bool shot_busy = core::shot_in_flight(g_brew.snapshot());
    if (g_update_check.network_ready() && !g_update_check.task_active() &&
        !shot_busy && g_update_check.take_check_request()) {
      core::logf("UpdateCheck: live check\n");
      g_update_check.begin_check();
    }
  }

  // First-boot health confirm for an OTA-installed image: the bootloader
  // boots it PENDING_VERIFY (verifyRollbackLater below defers the automatic
  // confirm), and a build that crashes/bootloops before this point is rolled
  // back automatically. Surviving 60 s of normal loop() = healthy.
  {
    static bool ota_checked = false;
    if (!ota_checked && millis() > 60000) {
      ota_checked = true;
      const esp_partition_t* run = esp_ota_get_running_partition();
      esp_ota_img_states_t st;
      if (esp_ota_get_state_partition(run, &st) == ESP_OK &&
          st == ESP_OTA_IMG_PENDING_VERIFY) {
        esp_ota_mark_app_valid_cancel_rollback();
        core::logf("OTA: new image confirmed healthy (rollback canceled)\n");
      }
    }
  }

  // Reflect the latest cached machine state in the UI (cheap; no BLE here).
  // NOTE this path re-sets many Home widgets — everything it touches must go
  // through the ui::set_* change-detecting setters (widgets.h): LVGL setters
  // invalidate even for identical values, and the resulting no-op churn
  // doubled every ~500ms render pass on the S3 (visible scroll stutter).
  static uint32_t last = 0;
  if (millis() - last > kUiRefreshMs) {
    last = millis();
    g_app.refresh();
  }

  // Sample temps into the history ring for the Stats charts (connected only).
  static uint32_t last_sample = 0;
  if (millis() - last_sample > kSampleMs) {
    last_sample = millis();
    const core::MachineSnapshot snap = g_micra.snapshot();
    if (snap.link == core::Link::Connected) {
      g_history.add(snap.brew_temp_c, snap.boiler_temp_c);
    }
  }

  // 1ms (was 5): under load the loop runs exactly once per LVGL frame, so the
  // whole delay lands on every frame's cadence — profiled at ~5ms/frame of
  // pure idle on the 5". 1ms still yields to lower-priority tasks.
  delay(1);
}
